-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Май 13 2021 г., 20:39
-- Версия сервера: 10.3.22-MariaDB
-- Версия PHP: 7.1.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `mysite`
--

-- --------------------------------------------------------

--
-- Структура таблицы `content`
--

CREATE TABLE `content` (
  `id_content` int(11) NOT NULL,
  `zagolovok` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `opisanie` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `image` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `id_page` int(11) NOT NULL,
  `img_doctor` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `about_doc` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `content`
--

INSERT INTO `content` (`id_content`, `zagolovok`, `opisanie`, `image`, `id_page`, `img_doctor`, `about_doc`) VALUES
(1, '⚕ Узи почек', 'Ультразвуковое исследование (УЗИ) почек – это классический метод диагностики, позволяющий безопасно и безболезненно для пациента оценить состояние почек, выявить возможные патологии и своевременно принять меры к их устранению.', '../../img/pochka.jpg', 2, '../../img/doctor/petrova.png', '					<pre><p><h4>Узи почек проводит квалифицированный специалист: <br> 																					   Петрова Светлана Анатольевна</p></h4></pre><br>'),
(2, '⚕ Узи щитовидной железы', 'УЗИ щитовидной железы – (Thyroid Ultraschall) это наиболее простой и высокоинформативный метод диагностики, который дает детальную оценку состоянию самой железы, а также соседствующих с ней анатомических образований – сосудов и мышц. Это возможно при использовании современных УЗ-датчиков с дополнительными возможностями. В частности, доплерография позволяет исследовать кровоснабжение щитовидной железы и рядом расположенных лимфатических узлов.', '../../img/shitovid.webp', 3, '../../img/doctor/ivanov.png', '					<pre><p><h4>Узи щитовидной железы проводит квалифицированный специалист: <br>																					   Иванов Петр Сергеевич</p></h4></pre><br>'),
(3, '⚕ МРТ головного мозга', 'Магнитно-резонансная томография (МРТ) – это неинвазивный диагностический метод, который позволяет с максимальной точностью установить диагноз и разработать эффективную схему лечения. Для визуализации головного мозга и его детального осмотра применяется воздействие мощнейших магнитных полей и высокочастотных импульсов.', '../../img/mozg.jpg', 4, '../../img/doctor/vasichkin.png', '					<pre><p><h4>МРТ головного мозга проводит квалифицированный специалист: <br>\r\n																					   Васичкин Анатолий Николаевич</p></h4></pre><br>'),
(4, '⚕ МРТ шейного отдела\r\n', 'МРТ шеи - это собирательное обозначение разных томографических обследований шейно-воротниковой зоны. Оно может подразумевать:\r\nМРТ шейного отдела позвоночника с контрастом или без.\r\nМагнитно-резонансное исследование сосудов шеи (или МР-ангиография шеи).\r\nМР-обследование мягких тканей шеи, органов и лимфатических узлов (оно же МРТ гортани и горла, МРТ языка и полости рта, МРТ щитовидной железы).', '../../img/sheya.jpg', 5, '../../img/doctor/smirnova.png', '					<pre><p><h4>МРТ шейного отдела проводит квалифицированный специалист: <br>\r\n																					   Смирнова Татьяна Андреевна</p></h4></pre><br>');

-- --------------------------------------------------------

--
-- Структура таблицы `news`
--

CREATE TABLE `news` (
  `id_news` int(11) NOT NULL,
  `zagolovok` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `opisanie` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `image` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `date` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `news`
--

INSERT INTO `news` (`id_news`, `zagolovok`, `opisanie`, `image`, `date`) VALUES
(1, 'В Роспотребнадзоре рассказали, чем опасны бессимптомные носители COVID', 'Бессимптомные носители коронавирусной инфекции могут заразить большое число окружающих, напомнили в Роспотребнадзоре.\r\n\r\nСегодня, как подчеркнула заместитель директора по клинико-аналитической работе ЦНИИ Эпидемиологии Роспотребнадзора, врач-инфекционист Наталья Пшеничная, эпидемический процесс в России постепенно стабилизируется, но говорить о том, что коронавирус побежден еще очень преждевременно.\r\n\r\n\"Продолжаются суточные колебания заболеваемости. Снижение сменяется небольшим подъемом. Как будет дальше развиваться ситуация, зависит от нас, - отметила эксперт. - Сейчас многие расслабились, забывают о выполнении санитарных правил. Между тем ряд исследований подтверждает, что бессимптомные носители инфекции могут быть источником заражения. Количество вируса у таких людей иногда даже выше, чем у тех, кто уже имеет клинические проявления заболевания. И как раз ношение масок в общественных местах защищает от таких бессимптомных носителей. Наша беспечность в отношении масок и гигиены рук может нам навредить\".', '', '2021-05-11'),
(2, 'Глава ВОЗ заявил, что заболеваемость и смертность от COVID-19 вышли в мире на плато', 'ЖЕНЕВА, 10 мая. /ТАСС/. Заболеваемость и смертность от заболевания COVID-19 вышли на плато на \"неприемлемо высоком уровне\": за минувшую неделю заразились более 5,4 млн человек и почти 90 тыс. умерли. Об этом заявил в понедельник на брифинге в Женеве генеральный директор Всемирной организации здравоохранения (ВОЗ) Тедрос Аданом Гебрейесус.\r\n\r\n\"На глобальном уровне мы сейчас видим выход на плато по числу случаев заболевания COVID-19 и числу смертей, - отметил он. - Однако это неприемлемо высокое плато: на минувшей неделе поступили сообщения о более 5,4 млн случаев заболевания и почти 90 тыс. умерших\".\r\n\r\nПо словам гендиректора, снижение заболеваемости и смертности наблюдается сейчас в Европе и регионе Северной и Южной Америки, которые пандемия коронавируса ранее затронула особенно сильно. Одновременно зафиксирован быстрый рост числа заразившихся и умерших в Юго-Восточной Азии, к которому ВОЗ относит также Индию. Кроме того, \"в каждом регионе есть страны с тенденцией к увеличению\" заболеваемости и смертности, констатировал Гебрейесус.\r\n\r\nГлава организации подчеркнул, что ослабление санитарных мер и \"неравная вакцинация\" способствуют распространению инфекции в мире. Он назвал отсутствие равного доступа к вакцинам \"одним из самых больших рисков\". \"На страны с высокими и средними доходами приходится 53% населения планеты, однако они получили 83% вакцины\", - напомнил гендиректор.', '', '2021-05-13'),
(3, 'Путин призвал активно вакцинироваться от COVID-19\r\n', 'СОЧИ, 10 мая - РИА Новости. Президент РФ Владимир Путин сообщил, что обсудил с главой Роспотребнадзора Анной Поповой вопросы борьбы с коронавирусом: надо соблюдать темпы вакцинации и масочный режим.\r\n\r\n\"Мы сегодня разговаривали с Анной Поповой, главным нашим санитарным врачом. И от своего имени, и от ее хочу обратиться к нашим гражданам продолжать прививочную кампанию\", - сказал Путин.', '', '2021-05-10'),
(4, 'На берегу Ганга нашли десятки тел умерших от COVID-19 индийцев', ' Не менее 30 тел были найдены на берегу реки Ганг в индийском штате Бихар, предварительно они могут принадлежать умершим от коронавируса людям, пишет The Times of India.\r\nВ издании предположили, что тела могли сбросить в воду родственники скончавшихся, так как процедура кремации в стране резко увеличилась на фоне рекордных показателей заражения COVID-19.\r\nГазета со ссылкой на местных жителей добавляет, что в реке, по разным данным, заметили 100 до 150 тел. Официально власти Бихара подтвердили обнаружение 30 тел, которые, предположительно, могло принести течением из соседнего штата Уттар-Прадеш. Кремация неопознанных тел состоится в соответствии с погребальными ритуалами за счет регионального правительства.', '', '2021-05-12'),
(5, 'Ученые рассказали о напитке, повышающем риск рака у женщин', ' Причиной рака кишечника у женщин в возрасте до 50 лет может стать употребление сладких напитков, пишет The Guardian со ссылкой на исследование американских ученых из Вашингтонского университета в Сент-Луисе.\r\nУченые выяснили, что употребление более полулитра таких напитков в день может повысить риск развития злокачественной опухоли в кишечнике.\r\nМежду тем, профессор прикладной статистики Кевин Макконвей не поддержал выводы коллег, указав на необходимость проведения дополнительных исследований.\r\nОн также призвал учитывать другие факторы, такие как употребление в пищу красного мяса, курение, алкоголь и избыточный вес.', '', '2021-05-11'),
(6, 'В России проверили качество выпущенного в Белоруссии \"Спутника V\"', 'Центр имени Гамалеи успешно завершил проверку качества вакцин против коронавируса \"Спутник V\", выпущенных на фармацевтическом предприятии в Белоруссии, передает РИА Новости со ссылкой на пресс-службу белорусского Минздрава.', '', '2021-05-13'),
(7, 'IT в медицине: помогают ли программы ставить диагнозы и обучать врачей', 'Большой объём знаний, документов и решений в сфере здравоохранения можно оцифровать и алгоритмизировать. Казалось бы, так проще - почему же тогда digital-решения для медиков не особо популярны? Может ли ИИ ставить диагноз вместо врача? Когда VR-шлемы появятся в каждом медвузе? Почему иногда медбрат или главврач предпочтёт заполнить отчёт на бумаге?\r\nРазобраться в теме помог Владимир Самойло - предприниматель, руководитель разработок ПО и IT-решений для медицинской отрасли.', '', '2021-05-10'),
(8, 'Индия снова поставила суточный антирекорд по случаям заражения COVID-19', 'Индия снова побила антирекорд по числу новых заболевших новой коронавирусной инфекцией, за минувшие сутки в стране выявили 414,1 тысячи новых инфицированных, передает Reuters.\r\nТаким образом, общее количество новых случаев инфекции за неделю достигло 1,57 млн, а за время пандемии число случаев заражения в Индии увеличилось до 21,49 млн человек.\r\nВыздоровели более 17,6 миллиона человек, умерли от коронавируса и сопутствующих заболеваний 234 тысячи человек.\r\nПремьер-министра Нарендра Моди заявил, что индийские штаты должны нарастить уровень вакцинации, а всеобщий локдаун будет введен только в случае крайней необходимости.', '', '2021-05-11'),
(9, 'Невролог связал холодные руки с наличием серьезного заболевания', 'лодные руки с большой вероятностью указывают на спазм сосудов, причины которого разнятся, рассказал в интервью телеканалу \"Звезда\" врач-невролог Павел Хорошев.\r\nПо его мнению, причиной этого может быть как патологическая реакция на холод или болезнь Рейно, которая выражается нарушением кровотока мелких сосудов кистей и стоп.\r\nХолодные руки также могут указывать на реакцию от приема лекарств или на понижение давления, продолжил специалист.', '', '2021-05-11'),
(11, 'ЗАГОЛОВОК 1', 'лодные руки с большой вероятностью указывают на спазм сосудов, причины которого разнятся, рассказал в интервью телеканалу \"Звезда\" врач-невролог Павел Хорошев.\r\nПо его мнению, причиной этого может быть как патологическая реакция на холод или болезнь Рейно, которая выражается нарушением кровотока мелких сосудов кистей и стоп.\r\nХолодные руки также могут указывать на реакцию от приема лекарств или на понижение давления, продолжил специалист.', '', '2021-05-12'),
(12, 'ЗАГОЛОВОК 2', 'лодные руки с большой вероятностью указывают на спазм сосудов, причины которого разнятся, рассказал в интервью телеканалу \"Звезда\" врач-невролог Павел Хорошев.\r\nПо его мнению, причиной этого может быть как патологическая реакция на холод или болезнь Рейно, которая выражается нарушением кровотока мелких сосудов кистей и стоп.\r\nХолодные руки также могут указывать на реакцию от приема лекарств или на понижение давления, продолжил специалист.', '', '2021-05-12');

-- --------------------------------------------------------

--
-- Структура таблицы `page`
--

CREATE TABLE `page` (
  `id_page` int(11) NOT NULL,
  `adress` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `page`
--

INSERT INTO `page` (`id_page`, `adress`) VALUES
(2, '/pages/usluga.php?usluga=1'),
(3, '/pages/usluga.php?usluga=2'),
(4, '/pages/usluga.php?usluga=3'),
(5, '/pages/usluga.php?usluga=4');

-- --------------------------------------------------------

--
-- Структура таблицы `user`
--

CREATE TABLE `user` (
  `id_user` int(11) NOT NULL,
  `fio` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email` varchar(150) COLLATE utf8mb4_unicode_ci NOT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `date_register` date DEFAULT NULL,
  `type_user` int(11) NOT NULL DEFAULT 2
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `user`
--

INSERT INTO `user` (`id_user`, `fio`, `email`, `password`, `date_register`, `type_user`) VALUES
(1, 'Тупикин Максим Николаевич', 'tupikin777@yandex.ru', '6c90e5171bfdc3c62ce8925898e0db2d', '2021-04-12', 1),
(2, 'Крапивченков Иван Валерьевич', 'krapiva@yandex.ru', '2c42e5cf1cdbafea04ed267018ef1511', '2021-04-12', 2),
(3, 'Тупикин Максим Николаевич', 'tupikin888@yandex.ru', '97d9122c5f720436412a44344768dd5d', '2021-04-26', 1);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `content`
--
ALTER TABLE `content`
  ADD PRIMARY KEY (`id_content`),
  ADD KEY `id_page` (`id_page`);

--
-- Индексы таблицы `news`
--
ALTER TABLE `news`
  ADD PRIMARY KEY (`id_news`);

--
-- Индексы таблицы `page`
--
ALTER TABLE `page`
  ADD PRIMARY KEY (`id_page`);

--
-- Индексы таблицы `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id_user`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `content`
--
ALTER TABLE `content`
  MODIFY `id_content` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT для таблицы `news`
--
ALTER TABLE `news`
  MODIFY `id_news` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT для таблицы `page`
--
ALTER TABLE `page`
  MODIFY `id_page` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT для таблицы `user`
--
ALTER TABLE `user`
  MODIFY `id_user` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `content`
--
ALTER TABLE `content`
  ADD CONSTRAINT `content_ibfk_1` FOREIGN KEY (`id_page`) REFERENCES `page` (`id_page`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
